// 정리
// C++에서 알아야 하는 것들

// 1. C 보다 발전된 형태의 C++ 문법들(객체지향 관련이적은)
// => reference, auto, template, new, nullptr, namespace
// => 1일차 ~ 2일차 오전


// 2. 객체지향 관련 문법
// => 필요한 타입을 먼저 만들자.
// => 함수와 데이타를 묶어서 타입을 만들자 ( C 구조체와 C++ 구조체의 차이점)

// => 안전하게 사용하도록 외부에서 멤버 데이타를 접근할수 없게 하자.
//    private, public 이 의미.

// => 객체의 멤버 데이타를 "자동으로 초기화" 되도록 하자.
//    생성자, 소멸자 문법

// => 그외에 사용하기 쉽고, 안전한 타입(클래스)를 만들때 필요한 다양한 문법들
//    내일 하루 종일 배우게 됩니다.(꽤 많습니다.)


// 3. 상속 ( 목요일)
//  => 클래스 한개를 만드는 이야기가 아닌
//  => 여러개의 클래스(타입)를 사용해서 "프로그램 전체를 객체지향으로 설계"하는법

// 4. C++ 표준라이브러리 사용법 설명, 기타 몇가지 문법 (금요일)



